# Ultralytics YOLO-Extreme Configuration
# Based on YOLOv12 with three key enhancements:
# 1. Dual-Branch Bottleneck Blocks (DBB) replace C3K2 modules
# 2. Multi-Dimensional Collaborative Attention (MCAM) at backbone end
# 3. Channel-Selective Fusion Blocks (CSFB) in neck

# Parameters
nc: 80  # number of classes
scales:  # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]  # summary: ~3.45M parameters, 9.1 GFLOPs
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO-Extreme backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 1-P2/4
  - [-1, 2, C3k2_DBB, [256, False, 0.25]]       # 2 - DBB replaces C3K2
  - [-1, 1, Conv, [256, 3, 2]]                   # 3-P3/8
  - [-1, 2, C3k2_DBB, [512, False, 0.25]]       # 4 - DBB replaces C3K2
  - [-1, 1, Conv, [512, 3, 2]]                   # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]              # 6 - Keep A2C2f for deeper features
  - [-1, 1, Conv, [1024, 3, 2]]                  # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]             # 8
  - [-1, 1, MultiDimensionalCollaborativeAttention, [1024]]                        # 9 - MCAM at backbone end

# YOLO-Extreme head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, ChannelSelectiveFusionBlock, []]                    # 11 - CSFB replaces Concat
  - [-1, 2, A2C2f_CSFB, [512, False, -1]]       # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, ChannelSelectiveFusionBlock, []]                    # 14 - CSFB replaces Concat
  - [-1, 2, A2C2f_CSFB, [256, False, -1]]       # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, ChannelSelectiveFusionBlock, []]                   # 17 - CSFB replaces Concat
  - [-1, 2, A2C2f_CSFB, [512, False, -1]]       # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, ChannelSelectiveFusionBlock, []]                   # 20 - CSFB replaces Concat
  - [-1, 2, C3k2_DBB, [1024, True]]             # 21 (P5/32-large) - DBB for final processing

  - [[15, 18, 21], 1, Detect, [nc]]             # Detect(P3, P4, P5)


# Training hyperparameters (from paper)
# optimizer: SGD
# momentum: 0.937
# weight_decay: 0.0005
# lr0: 0.01  # initial learning rate
# lrf: 0.01  # final learning rate (lr0 * lrf)
# epochs: 300
# batch: 32
# imgsz: 640
# patience: 100
# amp: False  # Automatic Mixed Precision disabled for stability
# conf: 0.5   # Confidence threshold for evaluation